Repository: microblink/blinkid-ios
Catalog: Source/BlinkIDUX/Localizable.xcstrings
Source language: en
Languages: ak, am, ar, bn, cs, da, de, el, es, es_mx, fa, fi, fil, fr, fr_ca, ha, he, hi, hr, hu, id, is, it, ja, ka_ge, kk, km_kh, ko, lv, ms, nb, ne, nl, pl, ps_af, pt, pt_br, ro, ru, si, sk, sl, sr, sv, sw, th, tr, uk, ur, uz, vi, yo, zh_hans, zh_hant

# mb_help_screen_barcode_msg1
source: Make sure you aren’t covering parts of the barcode with a finger. Also, watch out for reflections that go over the barcode and could make it unreadable.
ak: Hwɛ sɛ wo nsatea no bi nkata barkodu no fa bi. Afei nso, hwɛ sɛ hann biara nni barkodu no so a ɛmma wontumi nkan.
am: ባርኮዱን በጣትዎ አለመሸፈንዎን ያረጋግጡ። እንዲሁም በባርኮዱ ላይ የሚያርፉና ለማንበብ አስቸጋሪ ሊያደርጉ የሚችሉ የብርሃን ነጸብራቆችን ያስወግዱ።
ar: احرص على عدم تغطية أجزاء من الباركود بأحد أصابعك. تجنّب أيضاً الانعكاسات الضوئية التي تظهر على الباركود وقد تعوق قراءته.
bn: নিশ্চিত করুন যেন আপনার আঙুল দিয়ে বারকোডের কোনো অংশ ঢেকে না যায়। এছাড়া, বারকোডের ওপর পড়া কোনো প্রতিবিম্ব বা আলোর ঝলকানির দিকেও খেয়াল রাখবেন কারণ এর ফলে বারকোডটি পাঠযোগ্যতা হারাতে পারে।
cs: Zkontrolujte, zda část čárového kódu nezakrýváte prstem. Také dejte pozor na odlesky, které by mohly zapříčinit, že bude nečitelný.
da: Sørg for, at du ikke dækker dele af stregkoden med en finger. Pas også på refleksioner henover stregkoden, da de kan gøre den ulæselig.
de: Achten Sie darauf, dass Sie keine Teile des Barcodes mit einem Finger verdecken. Achten Sie auch auf störende Lichtreflexe, die den Barcode überlagern und ihn unlesbar machen könnten.
el: Βεβαιωθείτε ότι δεν καλύπτετε μέρη της κάρτας με το δάχτυλό σας, Επίσης, προσέξτε τις αντανακλάσεις που καλύπτουν τον γραμμωτό κώδικα και μπορεί να τον καταστήσουν μη αναγνώσιμο.
es: Asegúrate de no cubrir partes del código de barras con el dedo. También ten cuidado con los reflejos que puedan cubrirlo y hacerlo ilegible.
es_mx: Asegúrese de que no esté cubriendo partes del código de barras con un dedo. También, asegúrese que ningún reflejo se proyecte sobre el código de barras que pueda hacerlo ilegible.
fa: Hich bakhshi az barkod ra ba angosht napushanid. Moazebe baztabhayi bashid ke ruye barkod mioftand va momken ast an ra gheyr-e ghabele khandan konand.
fi: Varmista, ettet peitä viivakoodia sormella. Varo myös, ettei viivakoodin päälle synny heijastuksia, jotka tekisivät siitä lukukelvottoman.
fil: Siguradhing hindi mo natatakpan ng daliri ang mga bahagi ng barcode. Tingnan din kung may mga reflection sa barcode na dahilan para hindi mabasa ito.
fr: Veillez à ce que votre doigt ne recouvre pas certaines parties du code-barres. Faites également attention aux reflets qui masquent le code-barres et peuvent le rendre illisible.
fr_ca: Assurez-vous de ne pas couvrir certaines parties du code-barres avec un doigt. Faites également attention aux reflets qui pourraient se refléter sur le code-barres et le rendre illisible.
ha: A tabbatar da cewa ba a rufe wasu ɓangarorin barcode ɗin ba da yatsa. Bayan haka, a duba ko akwai wani dau na haske da ya hau kan barcode ɗin wanda kuma zai iya sa ba zai karantu ba.
he: ודאו שאינכם מכסים חלקים מהברקוד עם האצבע. כמו כן, היזהרו מהשתקפויות על גבי הברקוד שעלולות להפוך אותו לבלתי קריא.
hi: सुनिश्चित करें कि आप उंगली से बारकोड के किसी हिस्से को ढक नहीं रहे हैं। साथ ही, उन प्रतिबिंबों से भी सावधान रहें जो बारकोड पर पड़ सकते हैं और उसे अपठनीय बना सकते हैं।
hr: Pripazite da ne prekrivate dijelove barkoda prstom. Također, pazite na refleksije koje mogu prelaziti preko barkoda i učiniti ga nečitljivim.
hu: Ügyeljen arra, hogy a vonalkód egyes részeit ne takarja el az ujjával. Ezenkívül ügyeljen a tükröződésekre, amelyek a vonalkódon áthaladnak, és olvashatatlanná tehetik azt.
id: Pastikan jari Anda tidak menutupi bagian kode batang. Selain itu, hindari pantulan cahaya pada kode batang yang dapat menjadikannya tidak terbaca.
is: Gakktu úr skugga um að þú hyljir ekki hluta strikamerkisins með fingri. Gáðu einnig að endurkasti ljóss sem fer yfir strikamerkið og gæti gert það ólæsilegt.
it: Accertati di non coprire parzialmente con un dito il codice a barre. Verifica inoltre che non ci siano riflessi sul codice a barre, che potrebbero comprometterne la leggibilità.
ja: バーコードの一部を指で覆わないようにしてください。また、バーコードにかかる反射にもご注意ください。読み取れなくなる可能性があります。
ka_ge: დარწმუნდით, რომ თითით შტრიხკოდის ნაწილებს არ ფარავთ. ასევე, ფრთხილად იყავით ანარეკლებთანაც, რომლებიც შტრიხკოდზე გადადის და მის წაკითხვას შეუძლებელს ხდის.
kk: Штрихкодтың қандай да бір бөліктерін саусағыңызбен жаппағаныңызға көз жеткізіңіз. Сондай-ақ штрихкодты жауып, оны оқуға болмайтын етуі мүмкін жарқыраудан сақ болыңыз.
km_kh: ត្រូវបា្រកដថា អ្នកមិនកំពុងគ្របបាំងផ្នែកនៃបារកូដដោយម្រាមដៃទេ។ ដូចគ្នាផងដែរ ប្រយ័ត្នចំពោះចំណាំងផ្លាតដែលទៅពីលើបារកូដ ហើយអាចធ្វើឲ្យវាមិនអាចអានបាន។
ko: 손가락으로 바코드 일부를 가리지 않도록 주의하세요. 또한 바코드 위에 반사광이 생기면 인식이 어려울 수 있으니 주의하세요.
lv: Pārliecinieties, ka kādu svītrkoda daļu neaizsedzat ar pirkstu. Nodrošiniet arī, lai uz svītrkoda nebūtu atspīduma, jo šādā gadījumā svītrkods nebūs nolasāms.
ms: Pastikan anda tidak menutup mana-mana bahagian kod bar dengan jari. Selain itu, berhati-hati dengan pantulan cahaya yang merentasi kod bar dan boleh menjadikannya tidak boleh dibaca.
nb: Sørg for at du ikke dekker til deler av strekkoden med fingrene, og at det ikke går lysskjær gjennom strekkoden som gjør den uleselig.
ne: बारकोडको कुनै पनि भाग औँलाले नछोप्नुहोस्। साथै, बारकोडमा उज्यालो टल्किएको छ कि छैन विचार गर्नुहोस्, टल्केको भाग क्यामेराले चिन्न सक्दैन।
nl: Zorg ervoor dat je niet een deel van de barcode bedekt met een vinger. Pas ook op voor weerspiegelingen op de barcode, deze kunnen de code onleesbaar maken.
pl: Upewnij się, że nie zasłaniasz palcem żadnej części kodu kreskowego. Uważaj też na odbicia światła na kodzie kreskowym, które mogą utrudnić jego odczytanie.
ps_af: ډاډ حاصل کړئ چې د بارکوډ کومه برخه مو په ګوته پټه نکړئ. همدارنګه د وړانګو هغه غبرګون ته وګورئ چې پر بارکوډ راځي او کېدای شي بارکوډ و نه لوستل شي.
pt: Certifique-se de que não está a cobrir partes do código de barras com o dedo. Tenha também em atenção os reflexos sobre o código de barras e que poderão torná-lo ilegível.
pt_br: Certifique-se de não cobrir partes do código de barras com os dedos. Além disso, fique atento a reflexos sobre o código de barras, pois eles podem torná-lo ilegível.
ro: Asigurați-vă că nu acoperiți cu degetul anumite părți ale codului de bare. De asemenea, aveți grijă la reflexiile care apar pe codul de bare și l-ar putea face ilizibil.
ru: Убедитесь, что вы не закрываете пальцем части штрихкода. Также избегайте бликов, которые могут закрыть штрихкод и сделать его нечитаемым.
si: ඔබේ ඇඟිල්ලකින් බාර්කෝඩ් එකේ කොටස් ආවරණය නොවන බවට වග බලා ගන්න. එසේම බාර්කෝඩ් එකේ කොටස් කියවීම අපහසු කළ හැකි, ඒ මත ඇති වන පරාවර්තන පිළිබඳව අවධානයෙන් සිටින්න.
sk: Uistite sa, že časti čiarového kódu nezakrývate prstom. Dávajte si tiež pozor na odrazy, ktoré prechádzajú cez čiarový kód a môžu spôsobiť, že bude nečitateľný.
sl: Prepričajte se, da s prstom ne prekrivate delov črtne kode. Pazite tudi na odseve, ki prekrivajo črtno kodo in jo lahko naredijo nečitljivo.
sr: Uverite se da prstom ne prekrivate delove barkoda. Pazite i na odsjaje na barkodu zbog kojih bi mogao da bude nečitljiv.
sv: Se till att du inte täcker delar av streckkoden med fingret. Se också upp för reflektioner som går över streckkoden och kan göra den oläslig.
sw: Hakikisha hujafunika sehemu za msimbopau kwa kidole. Pia, kuwa mwangalifu na mwanga unaoakisiwa unaopita juu ya msimbopau na unaweza kuufanya usisomeke.
th: ตรวจสอบให้แน่ใจว่าคุณไม่ได้ใช้นิ้วบังส่วนต่างๆ ของบาร์โค้ด นอกจากนี้ ระวังแสงสะท้อนบนบาร์โค้ดและอาจทำให้ไม่สามารถอ่านได้
tr: Barkodun hiçbir bölümünü parmağınızla kapatmadığınızdan emin olun. Ayrıca, barkodun üzerinde parlayarak okunmasını engelleyebilecek ışık yansımalarına da dikkat edin.
uk: Переконайтеся, що ви не закриваєте частини штрих-коду пальцем. Також стежте за відблисками, які перекривають штрих-код і можуть зробити його нечитабельним.
ur: یقینی بنائیں کہ آپ کی انگلی بار کوڈ کے کسی حصے کو چھپا نہ رہی ہو۔ اس کے علاوہ، اس عکس کا بھی دھیان رکھیں جو بار کوڈ پر پڑتا ہے اور اس کو پڑھنے میں دشواری پیدا کرتا ہے۔
uz: Barmogʻingiz shtrix-kodning ayrim qismlarini berkitib qoʻymasin. Shtrix-kod boʻylab oʻtadigan va uni tushunarsiz chiqishiga sabab boʻladigan akslanishlarga ham diqqat qarating.
vi: Đảm bảo bạn không dùng ngón tay che các phần của mã vạch. Ngoài ra, hãy coi chừng ánh sáng phản chiếu trên mã vạch có thể khiến mã vạch không thể đọc được.
yo: Ríi dájú pé o kò fi ìka bo àwọn apá ibì kankan lórí kóòdù onílà náà. Bákannáà, ṣọ́ra fún àwọn ìtànyòò tó kọjá lórí kóòdù onílà náà tí ó lè mú kí ó má ṣeé kà.
zh_hans: 确保您的手指没有遮挡条形码。此外，请留意条形码上的反光，反光可能导致条形码无法读取。
zh_hant: 請確保手指沒有遮住條碼，並避免反光覆蓋條碼，以免無法辨識。

# mb_help_screen_barcode_msg2
source: Avoid direct harsh light because it can create glare on the barcode and make it difficult to scan. If the barcode isn’t clearly visible to you, the camera may not be able to read it either.
ak: Hwɛ sɛ awia ntɔ so tee efisɛ ebetumi ama barkodu no fa bi mma yiye na ɛbɛyɛ den sɛ wobetumi askane. Sɛ wanhu barkodu no yiye a, kamara no ntumi nkenkan no yiye nso.
am: ቀጥተኛና ኃይለኛ ብርሃን በባርኮዱ ላይ ነጸብራቅ ሊፈጥርና ለመቃኘት አስቸጋሪ ስለሚሆን፣ እባክዎ እንዲህ ዓይነቱን ብርሃን ያስወግዱ። ባርኮዱ ለእርስዎ በግልጽ የማይታይ ከሆነ፣ ካሜራውም ሊያነበው አይችልም።
ar: تجنَّب الضوء الساطع المباشر لأنه قد يُسبب وهجاً على الباركود ويُصعب مسحه. إذا لم ترى الباركود بوضوح، فقد لا تتمكن الكاميرا من قراءته.
bn: সরাসরি ও তীব্র আলো এড়িয়ে চলুন, কারণ এটি বারকোডের ওপর তীব্র গ্লেয়ার তৈরি করতে পারে এবং স্ক্যান করা কঠিন করে তুলতে পারে। বারকোডটি যদি আপনার কাছে স্পষ্টভাবে দৃশ্যমান না হয়, তবে ক্যামেরাও সম্ভবত সেটি পড়তে পারবে না।
cs: Vyhněte se přímému ostrému světlu, protože by mohlo způsobit odlesky na čárovém kódu a ztížit jeho naskenování. Pokud čárový kód dobře nevidíte, nemusí být dobře čitelný ani pro fotoaparát.
da: Undgå direkte skarpt lys, fordi det kan give genskin på stregkoden og gøre den vanskelig at scanne. Hvis du ikke kan se stregkoden tydeligt, kan kameraet måske heller ikke aflæse den.
de: Meiden Sie direktes, grelles Licht, da dieses Reflexionen auf dem Barcode verursachen und den Scanvorgang erschweren kann. Ist der Barcode für Sie nicht klar zu erkennen, ist er das für die Kamera möglicherweise auch nicht.
el: Αποφύγετε το άμεσο, έντονο φως, επειδή μπορεί να δημιουργήσει αντανάκλαση στον γραμμωτό κώδικα και να καταστήσει δύσκολη τη σάρωσή του. Αν δεν μπορείτε να δείτε καθαρά των κώδικα, δεν θα είναι αναγνώσιμος και από την κάμερα.
es: Evita la luz directa fuerte, ya que puede generar reflejos en el código de barras y dificultar el escaneo. Si no ves el código de barras con claridad, es posible que la cámara tampoco pueda leerlo.
es_mx: Evite luz intensa de manera directa, ya que esto puede provocar reflejos en el código de barras y esto dificultara su lectura. Si el código de barras no es visible para usted, la cámara tampoco será capaz de leerlo.
fa: Az nur-e mostaghim va shadid parhiz konid, zira mitavanad roye barkod baztab ijad konad va eskan-e an ra دشvar konad. Agar barkod ra be-vazeh nemibinid, momken ast dorbin ham natavanad an ra bekhanad.
fi: Vältä suoraa voimakasta valoa, koska se voi heijastua viivakoodista ja vaikeuttaa skannausta. Jos et näe viivakoodia selvästi, myöskään kamerasi ei pysty välttämättä lukemaan sitä.
fil: Iwasan ang direktang nakakasilaw na ilaw dahil maaari itong magdulot ng sinag sa barcode at magiging mahirap ang pag-scan. Kung hindi mo malinaw na nakikita ang barcode, posibleng hindi rin ito nababasa ng camera.
fr: Évitez la lumière directe et puissante, car celle-ci peut créer des reflets sur le code-barres et rendre sa lecture difficile. Si le code-barres n’est pas clairement visible, l’appareil photo risque de ne pas pouvoir le lire non plus.
fr_ca: Évitez la lumière directe et intense, car elle peut créer des reflets sur le code-barres et le rendre difficile à numériser. Si le code-barres n'est pas clairement visible pour vous, il se peut que l'appareil photo ne parvienne pas non plus à le lire.
ha: Kada a yi amfani da haske mai ƙarfi kai tsaye domin zai yi dau a kan barcode ɗin sannan zai sa ɗaukar hoton ya yi wahala. Idan ba kwa kallon barcode ɗin yadda ya kamata, to ba dole ba ne kamerarku ma ta iya karanta shi.
he: הימנעו מאור ישיר חזק מכיוון שהוא עלול ליצור סנוור על הברקוד ולהקשות על הסריקה. אם הברקוד אינו נראה לכם ברור, ייתכן שגם המצלמה לא תוכל לקרוא אותו.
hi: सीधी तेज़ रोशनी से बचें, क्योंकि यह बारकोड पर चमक पैदा कर सकती है और उसे स्कैन करना मुश्किल बना सकती है। अगर बारकोड आपको साफ दिखाई नहीं दे रहा है, तो हो सकता है कैमरा भी उसे न पढ़ पाए।
hr: Izbjegavajte izravnu jaku svjetlost jer može uzrokovati odsjaj na barkodu i otežati skeniranje. Ako vi ne vidite jasno barkod, ni kamera ga neće moći očitati.
hu: Kerülje a közvetlen, erős fényt, mert tükröződést okozhat a vonalkódon, és megnehezítheti a beolvasást. Ha a vonalkód az Ön számára sem látható tisztán, valószínűleg a kamera sem tudja beolvasni.
id: Hindari cahaya terang langsung karena dapat menimbulkan efek silau sehingga kode batang sulit dipindai. Jika kode batang tidak terlihat jelas, kamera tidak dapat membacanya.
is: Forðastu beint skarpt ljós, því það getur valdið glampa á strikamerkinu og gert það erfitt að skanna. Ef þú sérð strikamerkið ekki greinilega, gæti myndavélin einnig átt erfitt með að lesið það.
it: Evita la luce intensa diretta, perché può creare riflessi sul codice a barre e rendere difficile la scansione. Se non riesci a vedere bene il codice a barre, neanche la fotocamera potrà vederlo.
ja: 強い光を直接当てるとバーコードに反射してスキャンできなくなる可能性があるため、避けてください。バーコードがはっきり目視できない場合、カメラも読み取れない可能性があります。
ka_ge: მოერიდეთ პირდაპირ მკვეთრ განათებას, რადგან ის შტრიხკოდზე ანარეკლს აჩენს და მის დასკანერებას ართულებს. თუ შტრიხკოდი კარგად არ ჩანს, კამერამ შეიძლება ვერ დააფიქსიროს ის.
kk: Тіке түсетін жарық сәуледен аулақ болыңыз, себебі ол штрихкодқа шағылысып, оны сканерлеуді қиындатуы мүмкін. Егер штрихкод анық көрінбесе, камера оны оқи алмауы да ықтимал.
km_kh: ចៀសវាងពន្លឺផ្ទាល់ខ្លាំង ព្រោះវាអាចបង្កើតពន្លឺចាំងនៅលើបារកូដ ហើយធ្វើឲ្យវាពិបាកក្នុងការស្កេន។ ប្រសិនបើបារកូដមិនអាចមើលឃើញបានច្បាស់ចំពោះអ្នកទេ កាមេរ៉ាប្រហែលនឹងមិនអាចអានវាបានដែរ។
ko: 직사광선이나 강한 빛은 바코드에 반사를 일으켜 스캔을 어렵게 할 수 있으니 피하세요. 바코드가 육안으로도 잘 보이지 않는다면 카메라도 읽지 못할 수 있습니다.
lv: Izvairieties no tiešas spilgtas gaismas, jo tā var radīt atspīdumu uz svītrkoda, un to būs grūti skenēt. Ja jūs skaidri nesaredzat svītrkodu, arī kamera to nevarēs nolasīt.
ms: Jauhi cahaya yang boleh menyilaukan mata kerana cahaya tersebut boleh menyebabkan silau pada kod bar dan menyukarkan imbasan. Jika kod bar tidak jelas kelihatan kepada anda, kamera juga mungkin tidak dapat membacanya.
nb: Unngå skarpt lys, da dette kan gjenspeiles i strekkoden og gjøre det vanskelig å skanne den. Hvis du ikke kan se strekkoden klart, er den heller ikke synlig for kameraet.
ne: धेरै चर्को उज्यालोमा स्क्यान नगर्नुहोस्, उज्यालो टल्केर बारकोड चिनिन गाह्रो हुन्छ। यदि तपाईं आफैँले बारकोड स्पष्टसँग देख्नुभएको छैन भने, क्यामेराले पनि त्यसलाई ठम्याउन सक्दैन।
nl: Probeer geen rechtstreeks fel light te gebruiken, want dit kan weerspiegelen op de barcode en deze kan daardoor moeilijk te scannen zijn. Als de barcode voor jou niet duidelijk zichtbaar is, dan is hij mogelijk voor de camera ook niet goed te lezen.
pl: Unikaj bezpośredniego, ostrego światła, ponieważ może ono powodować odblaski na kodzie kreskowym i utrudniać jego skanowanie. Jeśli kod kreskowy nie jest dla Ciebie wyraźnie widoczny, aparat również może mieć problem z jego odczytaniem.
ps_af: له مستقیمې او ځلانده روښنایئ څخه ډډه وکړئ ځکه چې دا پر بارکوډ غبرګون مومي او سکن کول ستونزمن کېږي. که بارکوډ تاسو ته په روښانه توګه د لیدلو وړ نه وي، کامره نشي کولای هغه په اسانۍ سره ولولي.
pt: Evite uma iluminação forte e direta, a qual poderá criar reflexos no código de barras e torná-lo difícil de digitalizar. Se o código de barras não for claramente visível, a câmara poderá também não conseguir digitalizá-lo.
pt_br: Evite luzes fortes diretas, pois elas podem causar reflexos no código de barras e dificultar a digitalização. Se o código de barras não estiver claramente visível para você, a câmera provavelmente também não conseguirá lê-lo.
ro: Evitați lumina puternică directă, deoarece aceasta poate crea reflexii pe codul de bare și poate îngreuna scanarea. În cazul în care codul de bare nu este clar vizibil pentru dumneavoastră, este posibil ca nici camera să nu îl poată citi.
ru: Избегайте прямого яркого света, так как он может создавать блики и затруднять сканирование. Если штрихкод вам плохо виден, камера также может не суметь его считать.
si: බාර්කෝඩ් එක මත දිලිසීමක් ඇති වී එය ස්කෑන් කිරීමට අපහසු විය හැකි බැවින්, සෘජු රළු ආලෝකය වළක්වා ගන්න. ඔබට බාර්කෝඩ් එක පැහැදිලිව නොපෙනේ නම්, කැමරාවට ද එය කියවීමට නොහැකි විය හැක.
sk: Vyhnite sa priamemu ostrému svetlu, pretože môže na čiarovom kóde vytvoriť odlesky a sťažiť jeho snímanie. Ak vy nevidíte jasne čiarový kód, nebude ho vidieť ani kamera.
sl: Izogibajte se močni neposredni svetlobi, saj lahko povzroči bleščanje na črtni kodi in oteži skeniranje. Če črtna koda ni jasno vidna vam, je morda tudi kamera ne bo mogla prebrati.
sr: Izbegavajte jaku direktnu svetlost jer može stvoriti odsjaj na bar-kodu i otežati skeniranje. Ako bar-kod nije jasno vidljiv vama, možda neće biti čitljiv ni kameri.
sv: Undvik direkt starkt ljus eftersom det kan skapa reflektioner på streckkoden och göra den svår att skanna. Om streckkoden inte är tydligt synlig för dig kanske kameran inte heller kan läsa den.
sw: Epuka mwanga mkali wa moja kwa moja kwa sababu unaweza kusababisha mng'ao mkali kwenye msimbopau na kufanya iwe vigumu kuskani. Kama huoni vizuri msimbopau, kamera vilevile huenda isiweze kuusoma.
th: หลีกเลี่ยงแสงจ้าที่ส่องตรงๆ เพราะแสงสะท้อนบนบาร์โค้ดอาจทำให้สแกนไม่ได้ หากคุณเห็นว่าบาร์โค้ดไม่ชัดเจน กล้องก็อาจจะมองไม่เห็นเช่นกัน
tr: Doğrudan ve yoğun ışıktan kaçının; bu durum barkodun üzerinde parlama yaparak taranmasını zorlaştırır. Eğer barkod gözünüze net görünmüyorsa, büyük ihtimalle kamera da okuyamayacaktır.
uk: Уникайте прямого яскравого світла, оскільки воно може створювати відблиски на штрих-коді й ускладнювати його сканування. Якщо штрих-код чітко не видно вам, камера також може не зчитати його.
ur: براہ راست تیز روشنی سے گریز کریں کیونکہ اس سے بار کوڈ پر چمک پیدا ہو سکتی ہے اور اسے اسکین کرنا مشکل ہو جاتا ہے۔ اگر آپ کو بار کوڈ واضح طور پر نظر نہیں آ رہا، تو ممکن ہے کہ کیمرہ بھی اسے پڑھ نہ سکے۔
uz: Yorqin yorugʻlik bevosita tushmasin, chunki u shtrix-kodda aks etadi va skanerlashni qiyinlashtirishi mumkin. Shtrix-kod sizga aniq koʻrinmayotgan boʻlsa, kamera uni yaxshi ololmayotgan boʻlishi mumkin.
vi: Tránh ánh sáng gay gắt trực tiếp vì nó có thể tạo ra lóa sáng trên mã vạch và khiến việc quét trở nên khó khăn. Nếu mã vạch không rõ ràng với bạn, camera cũng có thể không đọc được.
yo: Yẹra fún ìmọ́lẹ̀ tó lágbára ní tààrà nítorí ó lè mú kí ìtànyòò wà lórí kóòdù onílà náà àti pé ó lè mú kí ó ṣòro látí ṣe àyẹ̀wò . Tí kóòdù onílà náà ò bá hàn sí ọ ní kedere, ó lè ṣòro fún kámẹ́rà náà láti gbée jáde.
zh_hans: 避免强光直射，因为这会在条码上产生眩光，导致难以扫描。如果您看不清条形码，相机也可能无法读取。
zh_hant: 避免強烈光源直接照射條碼，以免產生反光而影響掃描。若您看不清楚條碼，相機可能也無法看清。
